[
	{
		"name": "Black Hole",
		"leaderName": "Sturm",
		"adjective": ["Invaders"],
		"preferredVictoryType": "Domination",
		
		"startIntroPart1": "Sturm, you are a mighty and fearsome leader. You are a being who despise peace and enjoys the glories of war. Although little are known about your past, you are well known for the conquests and victories that you had achieved. No one knows how many have fallen victim by your ruthlessness and no one knows how many lives were paid for the countless wars that you have started. But despite of those, one thing is for sure, your men views you as an indomitable warrior and will do anything that you will even if it costs them death.",
		"startIntroPart2": "After travelling and venturing for so long, you then saw this planet filled with great civilizations that has their own unique characteristics, where some also seeks glory through wars such as you. Sturm, conqueror of the worlds, how shall you deal with this planet? Shall you crush them all and add the numbers of the fallen victims of your conquests? Or shall you take a different route this time?",
		
		"declaringWar": "Your time is about to come! Tremble before me and I may still spare your miserable life!",
		"attacked": "Fool! Do you really think you can defeat me?",
		"defeated": "You... Worm! Just a little more and I could have destroyed this miserable world!",
		"introduction": "Hmph! What do you want human?",
		
		"neutralHello": "What?",
		"neutralLetsHearIt": ["Speak.","Make it quick!","Go on."],
		"neutralNo": ["No.","I refuse.","I do not like your offer"],
		"neutralYes": ["Good.","Fine.","It is irrefusable."],

		"hateHello": "Speak worm!",
		"hateLetsHearIt": ["Go on!","Speak!","..."],
		"hateNo": ["Unacceptable!","This is insulting!","Do you wish to be destroyed right now?"],
		"hateYes": ["Hmph.","I cannot refuse.","Fine!"],
		
		"afterPeace": "Consider this as a sign of my mercy towards you.",
		"tradeRequest": "Be blessed that I made this offer at the first place.",

		"outerColor": [0,0,0],
		"innerColor": [255,255,255],
		"uniqueName": "True Warmongering",
		"uniqueText": "Units excel in combat no matter what are the situation, granting +20% combat bonus. Units also ignores terrain cost.",
		"uniques": ["+[20]% combat bonus for units fighting in [Friendly Land]","+[20]% combat bonus for units fighting in [Foreign Land]","[All] units gain the [Relentless Invasion] promotion"],
		"cities": ["Black Hole HQ","Saggitarius","Messier","Markarian","Centaurus","Fairall","Zwicky","Cygnus","Abell","Hercules","Holmberg","Cosmo Land","Macro Land","Omega Land","Sturm's Land","Lash Land",]
	}
]