[
	//Black Hole Units
	{
		"name": "Neotank",
		"unitType": "Armor",
		"movement": 5,
		"strength": 120,
		"cost": 475,
		"replaces": "Modern Armor",
		"uniqueTo": "Black Hole",
		"upgradesTo": "Giant Death Robot",
		"requiredTech": "Lasers",
		"requiredResource": "Aluminum",
		"uniques": ["Can move after attacking","No defensive terrain bonus"],
		"promotions": ["Mobility"],
		"attackSound": "tankshot",
		"civilopediaText": [
			{"text": 
				"			Strategy: These wonder weapons are stronger and faster than the ordinary modern tanks, with the only downside is that they are harder to produce than their counterparts and they appear very late in the game. Use these tanks to break and pierce through the enemy lines or to surprise and ambush other units. 
				
				Historical Info: Futuristic tanks first used by the Black Hole Forces, invented by one of their CO, Lash. Within the Advanced Wars 2 campaign, these tanks made its first appearance as the new monstrous weapons by the Black Hole, terrorizing allied soldiers, although the schematics and blueprints were later captured by the Allied Army and were reproduced to use against their Black Hole inventors."}
		]
	},
	
	{
		"name": "Meteor Strike",
		"unitType": "Missile",
		"movement": 1,
		"strength": 300,
		"rangedStrength": 300,
		"range": 12,
		"cost": 1000,
		"replaces": "Nuclear Missile",
		"uniqueTo": "Black Hole",
		"requiredTech": "Rocketry",
		"uniques": ["Self-destructs when attacking", "Nuclear weapon of Strength [2]", "Blast radius [2]"],
		"attackSound": "nuke",
		"civilopediaText": [
			{"text": 
				"			Strategy: Meteor Strikes are the same in terms of strength as their nuclear missile counterpart but has a higher attack range. The other differences is they do not need any uranium to be developed or needed to research the Manhattan Project. With these in mind, you can now use all of your uranium resources over the construction of other needed buildings and units.
			
				Historical Info: Before meteors became the fiery balls falling from the sky that we know, they are initially known as asteroids. Asteroids are a chunk of rocks that can be found orbiting a celestial body, from planets to stars. These rocks can vary in size, they can be as small as a grain of sand and can be as big as the size of a mountain. Within the Alverez theory, it suggests that a meteor once struck Earth, theoretically  the same size as Mt. Everest, causing a massive explosion of an estimated amount of 100,000,000 megatonnes of TNT exploding all at once, this theory is also known to theorize one of the possible causes of the Cretaceous-Paleogene Mass Extinction Event. Within the Advance Wars series, Sturm is notoriously known for his ability to pull meteors near the planet's orbit, crushing down the armies of his foes."}
		]
	},
	
	//Orange Star Units
	{
		"name": "Orange Bomber",
		"unitType": "Bomber",
		"movement": 2,
		"strength": 85,
		"rangedStrength": 85,
		"range": 20,
		"cost": 425,
		"replaces": "Stealth Bomber",
		"uniqueTo": "Orange Star",
		"requiredTech": "Stealth",
		"requiredResource": "Aluminum",
		"uniques": ["Damage taken from interception reduced by [120]%","[+4] Sight", "Can see over obstacles"],
		"attackSound": "bombing",
		"civilopediaText": [
			{"text": "			Strategy: Orange Bombers has the ability to dock on carriers, so now naval bombings are now easier to do now that there are bombers who can evade interception. They are also more resilient from interceptions compared to the normal stealth bombers.
			
			Historical Info: The Orange Star Variant of the Stealth Bomber. In the Advance Wars games, Stealth Bombers are great multi-role unit, capable of doing interceptions of their own. In fact they are immune to surface to air interception with the only way to hurt them is by intercepting them using fighter jets."}
		]
	},
	
	{
		"name": "Special Ops",
		"unitType": "Gunpowder",
		"movement": 3,
		"strength": 95,
		"cost": 400,
		"replaces": "Mechanized Infantry"
		"uniqueTo": "Orange Star"
		"requiredTech": "Mobile Tactics",
		"attackSound": "shot",
		"promotions": ["Besiege"]
		"civilopediaText": [
			{"text": " 			Strategy: Special Ops units are stronger than a usual mechanized infantry, they are also good at besieging cities. Since they are one of the strongest infantry in game, they can be used to fortify and defend key positions. Place them to block roads that can be used by the enemy at a good defensible terrain.
			
			Historical Info: Special Forces are one of the key components and an important branch of military within the modern field of warfare, where such operations can be traced back from the Second World War. Almost every nations within the world today have their own variations of special operation units. But within the nation of Orange Star, the special forces are trained to clear out houses and building much more effeciently than an average infantry. Trained under the Orange Star CO Sami, they are adept at holding key positions as well as capturing them."}
		]
	},
	
	//Blue Moon Units
	
	{
		"name": "Long Range MRLS",
		"unitType": "Siege",
		"movement": 2,
		"strength": 50,
		"rangedStrength": 60,
		"range": 4,
		"cost": 475,
		"replaces": "Rocket Artillery",
		"uniqueTo": "Blue Moon",
		"requiredTech": "Rocketry",
		"requiredResource": "Aluminum",
		"uniques": ["[+200]% Strength <vs cities> <when attacking>","No defensive terrain bonus","[-1] Sight","Ranged attacks may be performed over obstacles"],
		"attackSound": "artillery",
		"civilopediaText": [
			{"text": "Blue Moon's indirect combat brigades are one of the key strengths in their army, they excel the most under the command of the Blue Moon CO 'Grit'. Designs of Blue Moon's Rocket Artillery has a great similarity to the Soviet Union's MRLS model: BM-24. With an extended range compared to their regular counterparts, these rocket launchers can be a devestating component to the unprepared target."}
		]
	},
	
	//Yellow Comet Units
	
	{
		"name": "Assault Trooper",
		"unitType": "Gunpowder",
		"movement": 2,
		"strength": 70,
		"cost": 375,
		"replaces": "Paratrooper",
		"uniqueTo": "Yellow Comet",
//		"upgradesTo": "Xcom Squad",
		"requiredTech": "Radar",
		"uniques": ["May Paradrop up to [6] tiles from inside friendly territory","Ignores terrain cost"],
		"attackSound": "shot"
	},
	
	{
		"name": "Battle Helicopter",
		"unitType": "Helicopter",
		"movement": 6,
		"strength": 75,
		"cost": 425,
		"replaces": "Helicopter Gunship",
		"uniqueTo": "Yellow Comet",
		"requiredTech": "Computers",
		"requiredResource": "Aluminum",
		"uniques": ["[+100]% Strength <vs [Armored] units>", "No defensive terrain bonus", "Can move after attacking",
			"All tiles cost 1 movement", "Ignores Zone of Control", "Unable to capture cities"],
		"attackSound": "machinegun",
				"civilopediaText": [
			{"text": "Historical Info: Despite the faction in game is heavily based in the Imperial Japanese Army, the model of the Yellow Comet Battle Helicopter seems to be based on the Boeing MH-6 'Little Bird' which is made in the United States of America."}
		]
	},
	
	//Green Earth Units
	
	{
		"name": "Megatank",
		"unitType": "Armored",
		"movement": 2,
		"strength": 175,
		"cost": 500,
		"replaces": "Giant Death Robot",
		"uniqueTo": "Green Earth",
		"requiredTech": "Lasers",
		"uniques": ["Can move after attacking", "No defensive terrain bonus", "[-1] Sight","Consumes [2] [Oil]","Consumes [1] [Aluminum]"],
		"attackSound": "tankshot"
	}
]